Repository: abdoelbendary1/code_icons
Catalog: lib/l10n/app_*.arb
Languages: ar

# add_Collection_Title
source: Add Collection
ar: إضافه حافظة

source: Save
ar: حفظ

# customer_Name_DropDown_title
source: Customer Name
ar: إسم التاجر

# select_Customer_hint_text
source: Select Customer
ar: اختيار التاجر

# collection_Details_title
source: Collection Details
ar: تفاصيل الحافظة

# phone_Number_label
source: Phone Number
ar: رقم الموبايل

# phone_Number_hint
source: Enter your phone number
ar: من فضلك ادخل رقم الموبايل

# address_label
source: Address
ar: العنوان

# address_hint
source: Enter your address
ar: من فضلك ادخل العنوان

# registration_Number_label
source: Registration Number
ar: رقم السجل

# registration_Number_hint
source: Enter your registration number
ar: من فضلك ادخل رقم السجل

# registration_Date_label
source: Registration Date
ar: تاريخ التسجيل

# registration_Date_hint
source: Enter your registration date
ar: من فضلك ادخل تاريخ التسجيل

# commercial_activities_label
source: Commercial Activities
ar: النشاط التجاري

# commercial_activities_hint
source: Enter your Activity
ar: من فضلك ادخل النشاط التجارؤ

source: Years of Payment
ar: سنوات السداد

# payment_receipt_number_label
source: Payment receipt number
ar: رقم ايصال السداد

# payment_receipt_number_hint
source: Enter your Payment receipt number
ar: ادخل رقم ايصال السداد

# division_label
source: Division
ar: الشعبة

# division_hint
source: Enter your Division
ar: ادخل الشعبة

# compensation_label
source: Financial Compensation
ar: التعويض

# compensation_hint
source: Enter your compensation
ar: ادخل التعويض

# financial_arrears_label
source: Financial Arrears
ar: متأخرة

# financial_arrears_hint
source: Enter your Arrears
ar: ادخل المتاخرات

# current_finance_label
source: Current finance
ar: حالية

# current_hint
source: Enter your Current finance
ar: ادخل المدخلات الحاليه

# finance_Diffrence_label
source: Finance Diffrence
ar: متنوع

# finance_Diffrence_hint
source: Finance Diffrence
ar: ادخل المتنوع

# total_finance_label
source: Total finance
ar: اجمالى

# enter_your_Total_finance_hint
source: Enter your Total finance
ar: ادخل الاجمالي

# snackBar_error_year_of_paymentt
source: All previous years must be checked first.
ar: يجب سداد السنوات السابقه اولا
